IdeaRS.Connections
SpliceData Properties
Compatible with IDEA StatiCa 0.0
The SpliceData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
B1
B2
BackingPlateOffset
BackingPlateThickness
ConnectedPlatePath
 Gets or sets the item (plate) which is connected to the splice plate
ConnectedTo
 Gets or sets the information about the item which will be connected to the member.
ConnectionType
 Gets or sets the type of connection of two parts.
ExistingSplicePath
 Gets or sets the bottom object to which gusset plate is connected
Fastening
 Gets or sets the properties of the anchoring
IsActive |  (Inherited from ConnectionCmdData.)
IsBackingPlate
IsSymmetrical
 If true - connectors are taken from the existing splice
Member2Path
 Gets or sets the second member.
MemberPath
 Gets or sets the member
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NewSplicePosition
Offset1
Offset2
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
TransversalWeld
 Gets or sets the properties of the connected member to plate weld - transversal weld
Weld
 Gets or sets the properties of the connected member to plate weld - longitudinal weld
Top
See Also
Reference
SpliceData Class
IdeaRS.Connections.Data Namespace